In [25]:
import pandas as pd

In [26]:
user_cols = ['user_id', 'years_alive', 'Gender', 'Job','zip code']

finaltable = pd.read_table('http://files.grouplens.org/datasets/movielens/ml-100k/u.user',sep = '|', header=None, names = user_cols)

In [27]:
finaltable['Job']

0         technician
1              other
2             writer
3         technician
4              other
5          executive
6      administrator
7      administrator
8            student
9             lawyer
10             other
11             other
12          educator
13         scientist
14          educator
15     entertainment
16        programmer
17             other
18         librarian
19         homemaker
20            writer
21            writer
22            artist
23            artist
24          engineer
25          engineer
26         librarian
27            writer
28        programmer
29           student
           ...
913            other
914    entertainment
915         engineer
916          student
917        scientist
918            other
919           artist
920          student
921    administrator
922          student
923            other
924         salesman
925    entertainment
926       programmer
927          student
928        scientist
929        scientist
930         educator
931         educator
932          student
933         engineer
934           doctor
935            other
936         educator
937       technician
938          student
939    administrator
940          student
941        librarian
942          student
Name: Job, Length: 943, dtype: object

In [36]:
finaltable.Job + ',' +finaltable.Gender

0         technician,M
1              other,F
2             writer,M
3         technician,M
4              other,F
5          executive,M
6      administrator,M
7      administrator,M
8            student,M
9             lawyer,M
10             other,F
11             other,F
12          educator,M
13         scientist,M
14          educator,F
15     entertainment,M
16        programmer,M
17             other,F
18         librarian,M
19         homemaker,F
20            writer,M
21            writer,M
22            artist,F
23            artist,F
24          engineer,M
25          engineer,M
26         librarian,F
27            writer,M
28        programmer,M
29           student,M
            ...
913            other,F
914    entertainment,M
915         engineer,M
916          student,F
917        scientist,M
918            other,M
919           artist,F
920          student,F
921    administrator,F
922          student,M
923            other,M
924         salesman,F
925    entertainment,M
926       programmer,M
927          student,M
928        scientist,M
929        scientist,F
930         educator,M
931         educator,M
932          student,M
933         engineer,M
934           doctor,M
935            other,M
936         educator,M
937       technician,F
938          student,F
939    administrator,M
940          student,M
941        librarian,F
942          student,M
Length: 943, dtype: object

In [37]:
finaltable['Testing_add']=finaltable.Job + ',' +finaltable.Gender

In [38]:
finaltable.head()

   user_id  years_alive Gender         Job zip code   Testing_add
0        1           24      M  technician    85711  technician,M
1        2           53      F       other    94043       other,F
2        3           23      M      writer    32067      writer,M
3        4           24      M  technician    43537  technician,M
4        5           33      F       other    15213       other,F